<a href="https://colab.research.google.com/github/Medgoby/Article-summarization/blob/master/My_Data_Quality.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
pd.__version__

'1.1.5'

In [ ]:
list=[62,1,-5,34]
min=[0]
for e in list: 
  if e < min :
    min=e
print(min)

TypeError: ignored

## Lecture des fichiers

In [3]:
filepath='https://bit.ly/world-cities-clean'

In [4]:
print(filepath)

https://bit.ly/world-cities-clean

In [9]:
df=pd.read_csv(filepath)
df.sample(5)

           name        country  subcountry  geonameid
19377    Igunga       Tanzania      Tabora     159386
6540       Batī       Ethiopia      Amhara     342641
21951  Rosamond  United States  California    5388735
13195     Merke     Kazakhstan     Zhambyl    1520969
19120  İstanbul         Turkey    Istanbul     745044

In [15]:
fp='https://bit.ly/world-cities-dirty-v2'

In [16]:
print(fp)

https://bit.ly/world-cities-dirty-v2

In [18]:
df=pd.read_csv(fp)
df.sample(5)

                                                             Lorem ipsum dolor sit amet  ...  sunt in culpa qui officia deserunt mollit anim id est laborum.
South Jordan Heights United States Utah      5781765 NaN NaN                        NaN  ...                                                NaN
Eltville             Germany       Hesse     2930646 NaN NaN                        NaN  ...                                                NaN
Maarssen             Netherlands   Utrecht   2751316 NaN NaN                        NaN  ...                                                NaN
Gurupi               Brazil        Tocantins 3461724 NaN NaN                        NaN  ...                                                NaN
Mahanje              Tanzania      Ruvuma    155285  NaN NaN                        NaN  ...                                                NaN

[5 rows x 5 columns]

In [21]:
df=pd.read_csv(fp,
               skiprows=2, #enlève les deux prémières lignes
               skipfooter=1) #enlève la dernière ligne
df.sample(5)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

                name        country  subcountry  geonameid
22296   Frederickson  United States  Washington    5795011
11171         Mohali          India      Punjab    6992326
5298    Altglienicke        Germany      Berlin    2957185
20862       Wheeling  United States    Illinois    4916311
16527  Torres Vedras       Portugal      Lisbon    2262581

In [22]:
df.shape

(23018, 4)

In [23]:
fp='https://bit.ly/world-cities-dirty-v3'
print(fp)

https://bit.ly/world-cities-dirty-v3

In [28]:
df=pd.read_csv(fp, names=['names','country','subcountry','geonameid'],
               sep='|')
df.head()

              names               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [30]:
fp='https://bit.ly/bitcoin-data'
print(fp)

https://bit.ly/bitcoin-data

In [31]:
df=pd.read_csv(fp,
               skipfooter=2) 
df.sample(5)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.

           Date    Open*     High      Low  Close**       Volume    Market Cap
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  22633815180  130752796980
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  21167946112  130446112598
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  22445257702  134570835775
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  28767291327  148152237654

In [32]:
df.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

In [36]:
df.rename(columns={'Open*':'Open', 'Close**':'Close'}, inplace=True)
df.head()

          Date     Open     High      Low    Close       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [37]:
#Création d'une fonction permettant de remplacer les espaces par un tirêt du 8
def SansEspace (s):
  return s.replace (' ', '_')

In [39]:
#Essayer la fonction
SansEspace('Barry Mohamed')

'Barry_Mohamed'

In [40]:
#Appliquer sur le DataFrame
df.rename(SansEspace,
          axis='columns')

           Date     Open     High      Low    Close       Volume    Market_Cap
0   Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1   Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2   Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3   Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4   Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277
5   Jan 09 2020  8082.30  8082.30  7842.40  7879.07  24045990466  143016572819
6   Jan 08 2020  8161.94  8396.74  7956.77  8079.86  31672559265  146645162431
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  28767291327  148152237654
8   Jan 06 2020  7410.45  7781.87  7409.29  7769.22  23276261598  140976457304
9   Jan 05 2020  7410.45  7544.50  7400.54  7411.32  19725074095  134469548249
10  Jan 04 2020  7345.38  7427.39  7309.51  7410.66  18444271275  134442464030
11  Jan 03 2020  6984.43  7413.72  6915.00  7344.88  28111481032  133233444755
12  Jan 02 2020  7202.55  7212.16  6935.27  6985.47  20802083465  126699395235
13  Jan 01 2020  7194.89  7254.33  7174.94  7200.17  18565664997  130580829150
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  21167946112  130446112598
15  Dec 30 2019  7420.27  7454.82  7276.31  7293.00  22874131672  132235128152
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  22445257702  134570835775
17  Dec 28 2019  7289.03  7399.04  7286.91  7317.99  21365673026  132659059740
18  Dec 27 2019  7238.14  7363.53  7189.93  7290.09  22777360996  132139502950
19  Dec 26 2019  7274.80  7388.30  7200.39  7238.97  22787010034  131200030100
20  Dec 25 2019  7325.76  7357.02  7220.99  7275.16  21559505149  131840641292
21  Dec 24 2019  7354.39  7535.72  7269.53  7322.53  22991622105  132687583295
22  Dec 23 2019  7508.90  7656.18  7326.19  7355.63  27831788041  133275709111
23  Dec 22 2019  7191.19  7518.03  7167.18  7511.59  23134537956  136088022049
24  Dec 21 2019  7220.59  7223.23  7112.74  7191.16  19312552168  130267655889
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  22633815180  130752796980
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  25904604416  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  31836522778  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  20213265950  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  16881129804  129481424648

In [41]:
df.drop('Volume',
        axis='columns')

           Date     Open     High      Low    Close    Market Cap
0   Jan 14 2020  8140.93  8879.51  8140.93  8827.76  160319484883
1   Jan 13 2020  8189.77  8197.79  8079.70  8144.19  147890525973
2   Jan 12 2020  8033.26  8200.06  8009.06  8192.49  148752956966
3   Jan 11 2020  8162.19  8218.36  8029.64  8037.54  145924199942
4   Jan 10 2020  7878.31  8166.55  7726.77  8166.55  148249907277
5   Jan 09 2020  8082.30  8082.30  7842.40  7879.07  143016572819
6   Jan 08 2020  8161.94  8396.74  7956.77  8079.86  146645162431
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  148152237654
8   Jan 06 2020  7410.45  7781.87  7409.29  7769.22  140976457304
9   Jan 05 2020  7410.45  7544.50  7400.54  7411.32  134469548249
10  Jan 04 2020  7345.38  7427.39  7309.51  7410.66  134442464030
11  Jan 03 2020  6984.43  7413.72  6915.00  7344.88  133233444755
12  Jan 02 2020  7202.55  7212.16  6935.27  6985.47  126699395235
13  Jan 01 2020  7194.89  7254.33  7174.94  7200.17  130580829150
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  130446112598
15  Dec 30 2019  7420.27  7454.82  7276.31  7293.00  132235128152
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  134570835775
17  Dec 28 2019  7289.03  7399.04  7286.91  7317.99  132659059740
18  Dec 27 2019  7238.14  7363.53  7189.93  7290.09  132139502950
19  Dec 26 2019  7274.80  7388.30  7200.39  7238.97  131200030100
20  Dec 25 2019  7325.76  7357.02  7220.99  7275.16  131840641292
21  Dec 24 2019  7354.39  7535.72  7269.53  7322.53  132687583295
22  Dec 23 2019  7508.90  7656.18  7326.19  7355.63  133275709111
23  Dec 22 2019  7191.19  7518.03  7167.18  7511.59  136088022049
24  Dec 21 2019  7220.59  7223.23  7112.74  7191.16  130267655889
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  130752796980
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  129481424648

In [2]:
#df.drop_duplicates
#df.dropna
#df.rename(str.lower, axis='columns')
#df_copy=df.copy(deep=True)

In [3]:
fp='https://bit.ly/bitcoin-purchases'
print(fp)

https://bit.ly/bitcoin-purchases

In [4]:
df=pd.read_csv(fp)
df.head()

                      bitcoin address wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126

In [5]:
df.shape

(1000, 3)

In [6]:
df.dtypes

bitcoin address    object
wire amount        object
credit card         int64
dtype: object

In [7]:
#Suppression du sigle dollar
df['wire amount'].str.replace('$','')

0      2268.82
1      4590.27
2      6160.48
3      6647.19
4      3759.40
        ...
995    8777.99
996    7614.59
997    1710.21
998    5240.64
999    5672.95
Name: wire amount, Length: 1000, dtype: object

In [8]:
df['wire amount'].str.replace('$','').astype(float)

0      2268.82
1      4590.27
2      6160.48
3      6647.19
4      3759.40
        ...
995    8777.99
996    7614.59
997    1710.21
998    5240.64
999    5672.95
Name: wire amount, Length: 1000, dtype: float64

In [9]:
df['wire amount']=df['wire amount'].str.replace('$','').astype(float)

In [10]:
df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

In [11]:
fp='https://bit.ly/bitcoin-purchases2'
print(fp)

https://bit.ly/bitcoin-purchases2

In [12]:
df=pd.read_csv(fp)
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [14]:
df.tail()

                        bitcoin address wire amount          credit card
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433,63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814,11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

In [18]:
#Remplacer les virgules par des points
df['wire amount']=df['wire amount'].str.replace(',','.')

In [17]:
#Supression du symbole de la devise dans la colonne wire amount 
df['wire amount'].str.slice(1)

0      8356.92
1       311,06
2      2032,44
3      8155.74
4      3265.44
        ...
995     844.68
996    1433,63
997    3814,11
998    2900.85
999    1587.16
Name: wire amount, Length: 1000, dtype: object

In [19]:
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [ ]:
df['wire amount']=df['wire amount'].str.replace('$','').astype(float)
df['wire amount']=df['wire amount'].str.replace('£','').astype(float)
df['wire amount']=df['wire amount'].str.replace('€','').astype(float)
df['wire amount']=df['wire amount'].str.replace('¥','').astype(float)

In [20]:
#Création d'une colonne currency par les fonctions get ou slice
df['wire amount'].str.get(0)

0      £
1      €
2      €
3      ¥
4      £
      ..
995    ¥
996    €
997    €
998    $
999    $
Name: wire amount, Length: 1000, dtype: object

In [21]:
df['wire amount'].str.slice(stop=1)

0      £
1      €
2      €
3      ¥
4      £
      ..
995    ¥
996    €
997    €
998    $
999    $
Name: wire amount, Length: 1000, dtype: object

In [23]:
df['currency']=df['wire amount'].str.get(0)
df.head()

                      bitcoin address wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592        £

In [24]:
df['currency']=df['wire amount'].str.slice(stop=1)
df.head()

                      bitcoin address wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592        £

In [25]:
df['wire amount'].str.slice(1,None).astype(float)

0      8356.92
1       311.06
2      2032.44
3      8155.74
4      3265.44
        ...
995     844.68
996    1433.63
997    3814.11
998    2900.85
999    1587.16
Name: wire amount, Length: 1000, dtype: float64

In [26]:
df['wire amount']=df['wire amount'].str.slice(1).astype(float)
df.head()

                      bitcoin address  wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe      8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6      8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ      3265.44   374622922103592        £

In [27]:
fp='https://bit.ly/felonies-dataset'
print(fp)

https://bit.ly/felonies-dataset

In [28]:
df=pd.read_csv(fp)
df.head()

        Date of Arrest  Age Convicted
0  2014-07-16 14:59:18   77       Yes
1  2002-12-19 22:17:59   28       Yes
2  1994-06-28 09:31:40   21        No
3  1985-05-14 09:52:17   45       Yes
4  1985-05-25 14:06:28   39       Yes

In [29]:
df.dtypes

Date of Arrest    object
Age                int64
Convicted         object
dtype: object

In [32]:
df['Age'].describe()

count    1000.000000
mean       54.605000
std        25.225172
min        10.000000
25%        33.000000
50%        53.000000
75%        76.000000
max        99.000000
Name: Age, dtype: float64

In [33]:
#Recoder la date enfant 0-13, Adol 14-20, Adult 21-65, Seniors +65
pd.cut(df['Age'],
       bins=[9,13,20,65,100],
       labels=['Child','Ado','Adult','Senior'])

0      Senior
1       Adult
2       Adult
3       Adult
4       Adult
        ...
995    Senior
996    Senior
997    Senior
998     Adult
999     Adult
Name: Age, Length: 1000, dtype: category
Categories (4, object): ['Child' < 'Ado' < 'Adult' < 'Senior']

In [35]:
prefix=['ten','twent','thir','four','fif','six','seven','eigh','nine',]
for i, prefix in enumerate(prefix):
  age=(i+1)*10
  categoryName=prefix+'ties'
  print(f'* De {age} à {age+9} ans => {categoryName}')

* De 10 à 19 ans => tenties
* De 20 à 29 ans => twentties
* De 30 à 39 ans => thirties
* De 40 à 49 ans => fourties
* De 50 à 59 ans => fifties
* De 60 à 69 ans => sixties
* De 70 à 79 ans => seventies
* De 80 à 89 ans => eighties
* De 90 à 99 ans => nineties

 De 10 à 19 ans => tenties
* De 20 à 29 ans => twentties
* De 30 à 39 ans => thirties
* De 40 à 49 ans => fourties
* De 50 à 59 ans => fifties
* De 60 à 69 ans => sixties
* De 70 à 79 ans => seventies
* De 80 à 89 ans => eighties
* De 90 à 99 ans => nineties

In [36]:
# A dure
df['Date of Arrest'].str.slice(0,4)

0      2014
1      2002
2      1994
3      1985
4      1985
       ...
995    1992
996    1996
997    1980
998    1999
999    1996
Name: Date of Arrest, Length: 1000, dtype: object

In [38]:
df['Year']=df['Date of Arrest'].str.slice(0,4).astype(int)
df['Month']=df['Date of Arrest'].str.slice(5,7).astype(int)
df['Day']=df['Date of Arrest'].str.slice(8,10).astype(int)
df['Hours']=df['Date of Arrest'].str.slice(11,13).astype(int)
df['Minutes']=df['Date of Arrest'].str.slice(14,16).astype(int)
df['Secondes']=df['Date of Arrest'].str.slice(17,19).astype(int)
df.head()

        Date of Arrest  Age Convicted  Year  ...  Day  Hours  Minutes  Secondes
0  2014-07-16 14:59:18   77       Yes  2014  ...   16     14       59        18
1  2002-12-19 22:17:59   28       Yes  2002  ...   19     22       17        59
2  1994-06-28 09:31:40   21        No  1994  ...   28      9       31        40
3  1985-05-14 09:52:17   45       Yes  1985  ...   14      9       52        17
4  1985-05-25 14:06:28   39       Yes  1985  ...   25     14        6        28

[5 rows x 9 columns]

In [39]:
# a la coo
#consiste à caster le type str dans notre champ date en type datetime
pd.to_datetime(df['Date of Arrest'])

0     2014-07-16 14:59:18
1     2002-12-19 22:17:59
2     1994-06-28 09:31:40
3     1985-05-14 09:52:17
4     1985-05-25 14:06:28
              ...
995   1992-02-04 14:24:25
996   1996-04-29 18:03:23
997   1980-07-15 21:59:27
998   1999-07-05 17:16:12
999   1996-03-17 18:29:25
Name: Date of Arrest, Length: 1000, dtype: datetime64[ns]

In [51]:
df['Date of Arrest']=pd.to_datetime(df['Date of Arrest'])
df.dtypes

Date of Arrest    datetime64[ns]
Age                        int64
Convicted                 object
dtype: object

In [52]:
#df.drop(['Year','Day','Hours','Month','Minutes','Secondes'],axis=1,inplace=True)

In [53]:
df['Date of Arrest'].dt.date

0      2014-07-16
1      2002-12-19
2      1994-06-28
3      1985-05-14
4      1985-05-25
          ...
995    1992-02-04
996    1996-04-29
997    1980-07-15
998    1999-07-05
999    1996-03-17
Name: Date of Arrest, Length: 1000, dtype: object

In [54]:
df['Date of Arrest'].dt.month

0       7
1      12
2       6
3       5
4       5
       ..
995     2
996     4
997     7
998     7
999     3
Name: Date of Arrest, Length: 1000, dtype: int64

In [61]:
df['Date of Arrest'].dt.day

0      16
1      19
2      28
3      14
4      25
       ..
995     4
996    29
997    15
998     5
999    17
Name: Date of Arrest, Length: 1000, dtype: int64

In [56]:
df['Date of Arrest'].dt.time

0      14:59:18
1      22:17:59
2      09:31:40
3      09:52:17
4      14:06:28
         ...
995    14:24:25
996    18:03:23
997    21:59:27
998    17:16:12
999    18:29:25
Name: Date of Arrest, Length: 1000, dtype: object

In [57]:
df['Date of Arrest'].dt.dayofweek

0      2
1      3
2      1
3      1
4      5
      ..
995    1
996    0
997    1
998    0
999    6
Name: Date of Arrest, Length: 1000, dtype: int64

In [62]:
df['Date of Arrest'].dt.day_name()

0      Wednesday
1       Thursday
2        Tuesday
3        Tuesday
4       Saturday
         ...
995      Tuesday
996       Monday
997      Tuesday
998       Monday
999       Sunday
Name: Date of Arrest, Length: 1000, dtype: object

In [64]:
df['Date of Arrest'].dt.month_name()

0          July
1      December
2          June
3           May
4           May
         ...
995    February
996       April
997        July
998        July
999       March
Name: Date of Arrest, Length: 1000, dtype: object

In [65]:
df['Date of Arrest'].dt.year

0      2014
1      2002
2      1994
3      1985
4      1985
       ...
995    1992
996    1996
997    1980
998    1999
999    1996
Name: Date of Arrest, Length: 1000, dtype: int64